/*
	Assertion Testing ----------------- 断言 assert 用法： require('assert');  √
	Async Hooks ----------------------- 异步钩子
	Buffer ---------------------------- 二进制对象 用法：不需要引入 new Buffer('123') √

	-------------------------------------------------------------------------- 汇编语言（可用C/C++来写插件）
	C++ Addons
	C/C++ Addons - N-API
	-------------------------------------------------------------------------- 汇编语言

	-------------------------------------------------------------------------- 多进程相关
	Child Processes
	Cluster
	Process
	-------------------------------------------------------------------------- 多进程相关

	Command Line Options -------------- 命令行参数
	Console --------------------------- console.log()
	Crypto ---------------------------- 加密（md5等） 用法：require('crypto')  √
	
	-------------------------------------------------------------------------- 域名解析
	DNS 
	Domain
	Punycode -------------------------- 将Unicode转换为DNS系统的编码
	-------------------------------------------------------------------------- 域名解析

	ECMAScript Modules ---------------- ECMAScript模块 语言内自带
	Modules --------------------------- node自身模块系统

	Events ---------------------------- 事件监听 用法：require('events').EventEmitter  √
	File System ----------------------- 文件系统 用法：require('fs') √

	-------------------------------------------------------------------------- http
	HTTP ------------------------------ 用法： require('http'); √
	HTTP/2
	HTTPS
	-------------------------------------------------------------------------- http

	Inspector
	Internationalization

	-------------------------------------------------------------------------- 网络传输协议相关
	Net ------------------------------- (TCP)
	TLS/SSL
	TTY ------------------------------- 可以连接到Linux或者mac
	UDP/Datagram
	-------------------------------------------------------------------------- 网络传输协议相关

	OS -------------------------------- 操作系统
	Path ------------------------------ 获取扩展名 用法：require('path')

	-------------------------------------------------------------------------- 深入node内部做修改
	Performance Hooks ----------------- 性能钩子 评测程序性能
	V8
	VM
	-------------------------------------------------------------------------- 深入node内部做修改


	Query Strings --------------------- http请求字符串数据 解析为json对象
	Readline -------------------------- 一行行读数据 没有什么用
	REPL ------------------------------ (read evaluate print loop)就是在node命令行中可以直接执行代码
	Stream ---------------------------- 流操作 用法：require('stream') (只用过fs.createWriteStream())
	String Decoder -------------------- 字符串解码
	Timers ---------------------------- 定时器
	
	Trace Events
	
	
	URL ------------------------------- 网络url解析 用法：require('url')
	Utilities ------------------------- 小工具（Util 深度相等、继承等）
	
	Worker Threads
	ZLIB ------------------------------ 压缩
*/